import React from 'react';
import PageComponent from './PageComponent';
import './AboutUs.css';

// Import images
import missionImage from '../images/mission.png'; 
import historyImage from '../images/history.png'; 
import valuesImage from '../images/values.png'; 

function AboutUs() {
  return (
    <PageComponent title="Про нас">
      <div className="main-content">
        <section className="mission">
          <img src={missionImage} alt="Our Mission" className="about-image"/>
          <div>
            <h2>Наша місія</h2>
            <p>Наша місія полягає у наданні всебічних, інноваційних медичних послуг у турботливому, професійному середовищі, яке сприяє здоров'ю і благополуччю кожного пацієнта.</p>
            <p>Ми прагнемо забезпечити найвищу якість медичного обслуговування, використовуючи сучасні технології та передові методики лікування. Наша команда складається з висококваліфікованих фахівців, які завжди готові надати підтримку та допомогу кожному пацієнту.</p>
          </div>
        </section>
        <section className="history">
          <img src={historyImage} alt="Our History" className="about-image"/>
          <div>
            <h2>Наша історія</h2>
            <p>Заснована у 2010 році, наша клініка починалася як невелика амбулаторія і виросла у повноцінний медичний центр з передовими технологіями та фахівцями світового рівня.</p>
            <p>За ці роки ми не тільки розширили наші можливості, але й здобули довіру тисяч пацієнтів. Ми постійно інвестуємо у розвиток наших послуг та інфраструктури, щоб забезпечити найкращий досвід лікування для кожного, хто звертається до нас за допомогою.</p>
          </div>
        </section>
        <section className="values">
          <img src={valuesImage} alt="Our Values" className="about-image"/>
          <div>
            <h2>Наші цінності</h2>
            <p>Ми дотримуємося цінностей чесності, співчуття та відмінності у всіх наших взаємодіях і лікуваннях, забезпечуючи найвищий стандарт догляду.</p>
            <p>Наші цінності відображаються у всьому, що ми робимо. Ми віримо у важливість індивідуального підходу до кожного пацієнта, прагнучи створити атмосферу довіри та взаєморозуміння. Наші фахівці завжди готові вислухати, зрозуміти та запропонувати найкращі рішення для здоров'я та благополуччя наших пацієнтів.</p>
          </div>
        </section>
      </div>
    </PageComponent>
  );
}

export default AboutUs;
